# Listing 2.5
x = 2
y = 3

# Сложение
z = x + y
print('Мы выполнили сложение переменных X и Y')
print("Результат Z=", z) # Результат 5

# Вычитание
z = x - y
print('Мы выполнили вычитание переменных X и Y')
print("Результат Z=", z) # Результат -1

# Умножение
z = x * y
print('Мы выполнили умножение переменных X и Y')
print("Результат Z=", z) # Ре

# Деление
z = x / y
print('Мы выполнили деление переменных X и Y')
print("Результат Z=", z) # Результат 0.6

# Возведение в степень
z = x ** y
print('Мы выполнили возведение в степень переменных X и Y')
print("Результат Z=", z) # Результат 8
